/******************************************************/
/*                    Задача №14                      */
/* из Поляков: § 28 Операции с целыми числами         */
/*       Поменять местами две переменные              */
/*            используя оператор xor                  */
/******************************************************/
#include <iostream>

int main()
{
	uint8_t a = 0xc3;	//195
	uint8_t b = 87;		//87

	//a = a ^ b; 
	//b = b ^ a;
	//a = a ^ b;

	a ^= b;
	b ^= a;
	a ^= b;

	return 0;
}