/*
Приклад 10
10)	Написати програму, яка перевіряє, чи є введена з
клавіатури квадратна матриця «магічним квадратом».
Магічним квадра-том називається матриця, у якої сума чисел
у кожному горизонтальному ряду, в кожному вертикальному
і по кожній з діагоналей одна і та ж, як показано
на рис.:
2 9 4		13 8 12 1
7 5 3		2 11 7 14
6 1 8		3 10 6 15
			16 5 9 4
*/
#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include "windows.h"
#define SZ 5 // максимальний розмір матриці
void main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	int a[SZ][SZ];	// матриця
	int n;			// розмір матриці що перевіряється 
	int ok;			// матриця - "магічний" квадрат"
	int i, j;		// індекси масиву
	int sum;		// сума елементів головної діагоналі
	int temp;		// сума елементів поточного рядка, 
					// стовпчика
					// або другий діагоналі матриці
	printf("*** МАГІЧНИЙ КВАДРАТ ***\n");
	printf("\nВведіть розмір матриці (3..%i) -> ", SZ);
	scanf("%i", &n);
	printf("Введіть рядки матриці\n");
	printf("Після введення рядка %i цілих чисел, ", n);
	printf("натискайте <Enter>\n");
	for (i = 0; i < n; i++)
	{
		printf("->");
		for (j = 0; j < n; j++)
			scanf("%i", &a[i][j]);
	}
	ok = 1; // нехай матриця - "магічний" квадрат
	// обчислимо суму елементів головної діагоналі
	sum = 0;
	for (i = 0; i < n; i++)
		sum += a[i][i];
	// обчислюємо суми по рядках
	i = 0;
	do {
		temp = 0; // сума елементів поточного рядка
		for (j = 0; j < n; j++)
			temp += a[i][j];
		if (temp != sum) ok = 0;
		i++;
	} while (ok && i < n);
	if (ok)
	{
		// тут сума елементів кожного рядка
		// дорівнює сумі елементів головної діагоналі
		// обчислюємо суми по стовпцях
		j = 0;
		do {
			temp = 0; // сума ел-тів поточного стовпця
			for (i = 0; i < n; i++)
				temp += a[i][j];
				if (temp != sum) ok = 0;
			j++;
		} while (ok && i < n);
	}
	if (ok) {
		// тут сума елементів кожного рядка
		// дорівнює сумі елементів кожного стовпця
		// і сумі елементів головної діагоналі.
		// обчислимо суму елементів другої
		// головноЇ діагоналі
		temp = 0;
		i = n - 1;
		for (j = 0; j < n; j++)
			temp += a[i--][j];
		if (temp != sum) ok = 0;
	}
	printf("введена матриця ");
	if (!ok)
		printf("не ");
	printf("є магічним квадратом.\n");
	printf("\nДля завершення натисніть <Enter>");
	getchar();
}