/*
	Лабораторная работа №2 (1й семестр)
	Базовые типы данных и ввод-вывод

	http://khpi-iip.mipk.kharkiv.edu/library/pgm/lab/l02.html
*/

#define  _CRT_SECURE_NO_WARNINGS
#include <iostream>
#include "windows.h";
using namespace std;

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	//char name1[9], name2[9], name3[9];
	//char sc1, sc2, sc3;
	//int cnt1, cnt2, cnt3;
	//float sq1, sq2, sq3;

	char name1[9] = "Тодайдзи", name2[9] = "Якусидзи", name3[9] = "Дайдзи"; //strcpy(name1, "Тодайдзи");
	char sc1 = 'Т', sc2 = 'С', sc3 = 'Д';
	int cnt1 = 220, cnt2 = 50, cnt3 = 20;
	float sq1 = 368.8, sq2 = 54.7, sq3 = 12.2;
	/* Введение фактических данных*/
	printf("1. Введите: название, школу, количество, площадь >");
	scanf("%s %c %d %f", name1, &sc1, &cnt1, &sq1);
	printf("2. Введите: название, школу, количество, площадь >");
	scanf("%s %c %d %f", name2, &sc2, &cnt2, &sq2);
	printf("3. Введите: название, школу, количество, площадь >");
	scanf("%s %c %d %f", name3, &sc3, &cnt3, &sq3);

	/* Вывод таблицы */
	/* вывод заголовков */
	printf("-----------------------------------------------\n");
	printf("|Буддийские монастыри Японии периода Нара     |\n");
	printf("|---------------------------------------------|\n");
	printf("| Название | Школа | Количество |Площадь земли|\n");
	printf("|          |       |    монахов |    (га)     |\n");
	printf("|----------|-------|----------- |-------------|\n");
	/* вывод строк фактических данных */
	printf("| %8s | %5c | %10d | %-11.1f |\n", name1, sc1, cnt1, sq1);
	printf("| %8s | %5c | %10d | %-11.1f |\n", name2, sc2, cnt2, sq2);
	printf("| %8s | %5c | %10d | %-11.1f |\n", name3, sc3, cnt3, sq3);
	/* вывод примечаний */
	printf("|---------------------------------------------|\n");
	printf("| Примечание: Т - Тэндай; С - Сингон;         |\n");
	printf("|             Д - Дзедзицу                    |\n");
	printf("-----------------------------------------------\n");
	return 0;
}